tcc-portal-heroku/app/controllers/disciplines_controller.rb

  def index
    @disciplines = Discipline.all.order(:curso_id, :name)
---
SELECT "disciplines".* FROM "disciplines"  ORDER BY "disciplines"."curso_id" ASC, "disciplines"."name" ASC

  def create
    @discipline = Discipline.new(discipline_params)
    authorize @discipline

    respond_to do |format|
      if @discipline.save
---
INSERT INTO "disciplines" ("name", "workload", "ementa", "description", "bibliography", "curso_id", "professor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    authorize @discipline
    respond_to do |format|
      if @discipline.update(discipline_params)
---
UPDATE "disciplines" SET "curso_id" = $1, "professor_id" = $2, "updated_at" = $3 WHERE "disciplines"."id" = $4  [["curso_id", 2], ["professor_id", 3], ["updated_at", "2015-10-16 01:40:24.139762"], ["id", 1]]

    def set_discipline
      @discipline = Discipline.find(params[:id])
---
SELECT  "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT 1  [["id", nil]]