app/views/registration_courses/_form.html.erb

SELECT "cursos".* FROM "cursos"
---
    <%= f.label :curso_id %><br>
    <%= f.select :curso_id, Curso.all.collect { |curso| [ curso.nome, curso.id ] }, {prompt: "Selecione um curso"}, :selected => params[:curso_id] %>