tcc-portal-heroku/app/views/cursos/show.html.erb

  <strong>Disciplinas:</strong>
  <% @curso.disciplines.each do |discipline| %>
---
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."curso_id" = $1  [["curso_id", 1]]