app/controllers/arduino_clients_controller.rb

  def index
    @arduinos = Arduino.all
---
SELECT "arduinos".* FROM "arduinos"