app/controllers/cursos_controller.rb

SELECT "cursos".* FROM "cursos"
---
  def index
    @cursos = Curso.all

INSERT INTO "cursos" ("nome", "descricao", "coordenador_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "Ciencias"], ["descricao", "ciencias"], ["coordenador_id", 1], ["created_at", "2015-10-15 18:56:01.450845"], ["updated_at", "2015-10-15 18:56:01.450845"]]
---
  def create
    @curso = Curso.new(curso_params)

    respond_to do |format|
      if coordenador? and @curso.save

UPDATE "cursos" SET "aluno_id" = $1, "professor_id" = $2, "coordenador_id" = $3, "updated_at" = $4 WHERE "cursos"."id" = $5  [["aluno_id", 2], ["professor_id", 3], ["coordenador_id", 4], ["updated_at", "2015-10-15 17:38:34.531318"], ["id", 1]]
---
  def update
    respond_to do |format|
      if coordenador?
        if @curso.update(curso_params)

DELETE FROM "cursos" WHERE "cursos"."id" = $1  [["id", 1]]
---
  def destroy
    @curso.destroy

SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_curso
      @curso = Curso.find(params[:id])