app/controllers/disciplines_controller.rb

  def index
    @disciplines = Discipline.all.order(:curso_id, :name)
---
SELECT "disciplines".* FROM "disciplines"  ORDER BY "disciplines"."curso_id" ASC, "disciplines"."name" ASC