app/controllers/registration_courses_controller.rb

  def index
    if current_user != nil && current_user.role == 'aluno'
      @registration_courses = RegistrationCourse.all.where(aluno_id: current_user.id).order(:curso_id)
    elsif current_user != nil && (current_user.role == 'professor' || current_user.role == 'coordenador')
      @registration_courses = RegistrationCourse.joins(:curso => :disciplines).all.where("disciplines.professor_id = ?", current_user.id).order(:curso_id).group("registration_courses.id, registration_courses.curso_id")
    else
      @registration_courses = RegistrationCourse.all.order(:curso_id)
---
SELECT "registration_courses".* FROM "registration_courses" WHERE "registration_courses"."aluno_id" = $1  ORDER BY "registration_courses"."curso_id" ASC  [["aluno_id", 9]]
SELECT "registration_courses".* FROM "registration_courses" INNER JOIN "cursos" ON "cursos"."id" = "registration_courses"."curso_id" INNER JOIN "disciplines" ON "disciplines"."curso_id" = "cursos"."id" WHERE (disciplines.professor_id = 5) GROUP BY registration_courses.id, registration_courses.curso_id  ORDER BY "registration_courses"."curso_id" ASC
SELECT "registration_courses".* FROM "registration_courses" INNER JOIN "users" ON "users"."registration_course_id" = "registration_courses"."id"  ORDER BY "registration_courses"."curso_id" ASC, "registration_courses"."aluno_id" ASC

  def show
    authorize @registration_course

    if current_user != nil && current_user.role == 'aluno'
      @registration_course = RegistrationCourse.find(params[:id])
    elsif current_user != nil && (current_user.role == 'professor' || current_user.role == 'coordenador')
      @registration_courses = Discipline.all.where(professor_id: current_user.id).order(:name)
---
SELECT  "registration_courses".* FROM "registration_courses" WHERE "registration_courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."professor_id" = $1  ORDER BY "disciplines"."name" ASC  [["professor_id", 5]]

  def create
    @registration_course = RegistrationCourse.new(registration_course_params)
    authorize @registration_course

    @registration_course.locked = false
    @registration_course.admission_date = DateTime.now.to_date#Time.now.strftime("%m-%d-%Y %H:%M:%S")
    @registration_course.aluno_id = current_user.id

    respond_to do |format|
      if @registration_course.save
---
INSERT INTO "registration_courses" ("curso_id", "locked", "admission_date", "aluno_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["curso_id", 2], ["locked", "f"], ["admission_date", "2015-10-16"], ["aluno_id", 9], ["created_at", "2015-10-16 14:27:05.544371"], ["updated_at", "2015-10-16 14:27:05.544371"]]

  def update
    authorize @registration_course
    respond_to do |format|
      #@registration_course.conclusion_date = DateTime.now.to_date#Time.now.strftime("%m-%d-%Y %H:%M:%S")
      if @registration_course.update(registration_course_params)
---
UPDATE "registration_courses" SET "curso_id" = $1, "aluno_id" = $2, "updated_at" = $3 WHERE "registration_courses"."id" = $4  [["curso_id", 1], ["aluno_id", 2], ["updated_at", "2015-10-16 13:40:04.701269"], ["id", 1]]

  def destroy
    authorize @registration_course
    @registration_course.destroy
---
DELETE FROM "registration_courses" WHERE "registration_courses"."id" = $1  [["id", 1]]

    def set_registration_course
      @registration_course = RegistrationCourse.find(params[:id])
---
SELECT  "registration_courses".* FROM "registration_courses" WHERE "registration_courses"."id" = $1 LIMIT 1  [["id", 1]]