app/controllers/registration_courses_controller.rb

  def index
    @registration_courses = RegistrationCourse.all
---
SELECT "registration_courses".* FROM "registration_courses"