app/controllers/users_controller.rb

INSERT INTO "users" ("nome", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome", ""], ["created_at", "2015-10-16 21:26:41.312063"], ["updated_at", "2015-10-16 21:26:41.312063"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "nome" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["nome", "Aluno Sofredor 3"], ["encrypted_password", "$2a$10$aAdCfN0litxBK3cOW3pf/OdRYITutrvO0bjydjXozaubDhNqjQ5pO"], ["updated_at", "2015-10-16 23:40:22.471110"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)